[
    {
      "id": 1,
      "title": "Top 10 Movies to Watch in 2025",
      "description": "2025 is shaping up to be an exciting year for movie lovers, with a lineup of films that span across various genres including action, drama, sci-fi, and comedy. This article highlights the top 10 movies that are expected to make a major impact at the box office and capture the attention of audiences worldwide. From highly anticipated sequels to brand new stories from visionary directors, discover why these films deserve a spot on your watchlist. Whether you're into heart-pounding action sequences or mind-bending sci-fi narratives, 2025 will have something to offer for everyone.",
      "author": "John Moviebuff",
      "date": "January 3, 2025",
      "image": "https://images.unsplash.com/photo-1626814026160-2237a95fc5a0?w=400&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8M3x8bW92aWUlMjBwb3N0ZXJ8ZW58MHx8MHx8fDA%3D"
    },
    {
      "id": 2,
      "title": "5 Underrated Sci-Fi Movies You Must Watch",
      "description": "Science fiction has long been a genre that pushes the boundaries of imagination, often offering speculative visions of the future, technology, and society. While big-budget blockbusters often dominate the spotlight, there are plenty of underrated sci-fi films that deserve more attention. These hidden gems explore thought-provoking ideas, stunning visuals, and captivating storylines that offer something beyond the mainstream. In this article, we'll explore five of the best underrated sci-fi movies that are perfect for fans of the genre who want to discover something fresh, innovative, and truly unique.",
      "author": "Sarah Cinephile",
      "date": "December 27, 2024",
      "image": "https://plus.unsplash.com/premium_photo-1722018576685-45a415a4ff67?w=400&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NXx8U2NpJTIwRmklMjBNb3ZpZXN8ZW58MHx8MHx8fDA%3D"
    },
    {
      "id": 3,
      "title": "The Evolution of Superhero Movies",
      "description": "Superhero movies have become one of the most dominant genres in Hollywood, consistently breaking box office records and captivating audiences with larger-than-life characters and epic storytelling. This article takes a deep dive into the evolution of superhero films, tracing their journey from early comic book adaptations like 'Superman' and 'Batman' to the modern cinematic universe phenomenon we know today. We explore the cultural impact of iconic characters, the changing dynamics of superhero stories, and how filmmakers have pushed the boundaries of visual effects to bring these larger-than-life figures to the big screen. Join us as we look back at the landmark films and milestones that have defined this genre.",
      "author": "Alex FilmFan",
      "date": "November 15, 2024",
      "image": "https://images.unsplash.com/photo-1608889175250-c3b0c1667d3a?w=400&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MjB8fFN1cGVyaGVybyUyME1vdmllc3xlbnwwfHwwfHx8MA%3D%3D"
    }
  ]
  